src/DataProcessors/КАЗ_ИмпортЗаявокИзФайла/КАЗ_ИмпортЗаявокИзФайла.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КАЗ_ИмпортЗаявокИзФайла</name>
</mdclass:DataProcessor>

src/Enums/КАЗ_СтатусыЗаявки/КАЗ_СтатусыЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КАЗ_СтатусыЗаявки</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Согласована</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>ВРеестре</name>
  </enumValues>
  <enumValues>
    <name>Оплачена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

src/Documents/КАЗ_ЗаявкаНаОплату/КАЗ_ЗаявкаНаОплату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАЗ_ЗаявкаНаОплату</name>
  <registerRecords>AccumulationRegister.КАЗ_ПлановыеПлатежи</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяПлатежа</name>
    <type>
      <types>CatalogRef.КАЗ_СтатьиПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.КАЗ_ЦентрыФинансовойОтветственности</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.КАЗ_ПриоритетыПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.КАЗ_СтатусыЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОчередьОплаты</name>
    <type>
      <types>CatalogRef.КАЗ_ОчередиПлатежей</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/КАЗ_ИмпортЗаявокИзФайла/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ВыбратьФайл(Команда)

	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите файл с заявками";
	ДиалогВыбора.Фильтр = "Файлы Excel (*.xlsx)|*.xlsx";
	ДиалогВыбора.Множественныйвыбор = Ложь;

	Если ДиалогВыбора.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗаявки(Команда)

	Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Сообщить("Не выбран файл.");
		Возврат;
	КонецЕсли;

	РезультатыЗагрузки.Очистить();

	Итог = ЗагрузитьИзФайлаНаСервере(ПутьКФайлу);

	Сообщить("Загружено заявок: " + Итог.КоличествоЗагружено + ". Ошибок: " + Итог.КоличествоОшибок + ".");

КонецПроцедуры

// Читает Excel-файл (шапка в первой строке: ЦФО | Статья платежа | Контрагент |
// Сумма | Основание) и создает по каждой строке черновик КАЗ_ЗаявкаНаОплату.
// Документы не проводятся - пользователь проверяет результат в таблице
// предпросмотра и проводит заявки сам.
&НаСервере
Функция ЗагрузитьИзФайлаНаСервере(ПутьКФайлу)

	ТабДок = Новый ТабличныйДокумент;
	Попытка
		ТабДок.Прочитать(ПутьКФайлу);
	Исключение
		Сообщить("Не удалось прочитать файл: " + ОписаниеОшибки());
		Возврат Новый Структура("КоличествоЗагружено, КоличествоОшибок", 0, 0);
	КонецПопытки;

	КоличествоЗагружено = 0;
	КоличествоОшибок = 0;

	НомерСтроки = 2; // первая строка - шапка, пропускаем
	Пока Истина Цикл

		ИмяЦФО = СокрЛП(ТабДок.Область(НомерСтроки, 1, НомерСтроки, 1).Текст);
		Если ПустаяСтрока(ИмяЦФО) Тогда
			Прервать; // дошли до конца данных
		КонецЕсли;

		ИмяСтатьи = СокрЛП(ТабДок.Область(НомерСтроки, 2, НомерСтроки, 2).Текст);
		ИмяКонтрагента = СокрЛП(ТабДок.Область(НомерСтроки, 3, НомерСтроки, 3).Текст);
		ТекстСуммы = СокрЛП(ТабДок.Область(НомерСтроки, 4, НомерСтроки, 4).Текст);
		Основание = СокрЛП(ТабДок.Область(НомерСтроки, 5, НомерСтроки, 5).Текст);

		СтрокаРезультата = РезультатыЗагрузки.Добавить();
		СтрокаРезультата.НомерСтроки = НомерСтроки;
		СтрокаРезультата.ЦФО = ИмяЦФО;
		СтрокаРезультата.СтатьяПлатежа = ИмяСтатьи;
		СтрокаРезультата.Контрагент = ИмяКонтрагента;
		СтрокаРезультата.Сумма = ЧислоИзСтроки(ТекстСуммы);

		ЦФО = Справочники.КАЗ_ЦентрыФинансовойОтветственности.НайтиПоНаименованию(ИмяЦФО, Истина);
		Статья = Справочники.КАЗ_СтатьиПлатежей.НайтиПоНаименованию(ИмяСтатьи, Истина);
		Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(ИмяКонтрагента, Истина);

		Если Не ЗначениеЗаполнено(ЦФО) Тогда
			СтрокаРезультата.Статус = "Ошибка";
			СтрокаРезультата.Комментарий = "Не найден ЦФО: " + ИмяЦФО;
		ИначеЕсли Не ЗначениеЗаполнено(Статья) Тогда
			СтрокаРезультата.Статус = "Ошибка";
			СтрокаРезультата.Комментарий = "Не найдена статья платежа: " + ИмяСтатьи;
		ИначеЕсли Не ЗначениеЗаполнено(Контрагент) Тогда
			СтрокаРезультата.Статус = "Ошибка";
			СтрокаРезультата.Комментарий = "Не найден контрагент: " + ИмяКонтрагента;
		ИначеЕсли СтрокаРезультата.Сумма <= 0 Тогда
			СтрокаРезультата.Статус = "Ошибка";
			СтрокаРезультата.Комментарий = "Некорректная сумма: " + ТекстСуммы;
		Иначе

			Документ = Документы.КАЗ_ЗаявкаНаОплату.СоздатьДокумент();
			Документ.Дата = ТекущаяДата();
			Документ.ЦФО = ЦФО;
			Документ.СтатьяПлатежа = Статья;
			Документ.Контрагент = Контрагент;
			Документ.СуммаДокумента = СтрокаРезультата.Сумма;
			Документ.ОснованиеПлатежа = Основание;
			Документ.Статус = Перечисления.КАЗ_СтатусыЗаявки.Черновик;
			Документ.Комментарий = "Импортировано из файла: " + ПутьКФайлу;
			Документ.Записать();

			СтрокаРезультата.Статус = "Загружено";
			СтрокаРезультата.Комментарий = "Заявка создана (черновик)";
			КоличествоЗагружено = КоличествоЗагружено + 1;

		КонецЕсли;

		Если СтрокаРезультата.Статус = "Ошибка" Тогда
			КоличествоОшибок = КоличествоОшибок + 1;
		КонецЕсли;

		НомерСтроки = НомерСтроки + 1;

	КонецЦикла;

	Возврат Новый Структура("КоличествоЗагружено, КоличествоОшибок", КоличествоЗагружено, КоличествоОшибок);

КонецФункции

&НаСервереБезКонтекста
Функция ЧислоИзСтроки(Текст)

	Попытка
		Возврат Число(СтрЗаменить(Текст, ",", "."));
	Исключение
		Возврат 0;
	КонецПопытки;

КонецФункции
